## 1) Write an SQL query to find all dates, temp, Id with higher temperatures compared to its previous dates (yesterday).
<pre>
Input:		
ID	RECORD_DATE	TEMEPERATURE
1	01-01-2015	10
2	02-01-2015	25
3	03-01-2015	20
4	04-01-2015	30
		
Output:		
ID	RECORD_DATE	TEMEPERATURE
2	02-01-2015	25
4	04-01-2015	30
</pre>

## 2) List the jobs unique to department 20?
## 3) List the employees belonging to the department of ‘MILLER’?
## 4) List all the employees who have the same job as ‘SCOTT’?

<pre>
## 1) Write an SQL query to find all dates, temp, Id with higher temperatures compared to its previous dates (yesterday).
Input:        
+------+-------------+-------------+
| id   | record_date | temperature |
+------+-------------+-------------+
|    1 | 2015-01-01  |          10 |
|    2 | 2015-01-02  |          25 |
|    3 | 2015-01-03  |          20 |
|    4 | 2015-01-04  |          30 |
+------+-------------+-------------+

Output:        
+------+-------------+-------------+
| id   | record_date | temperature |
+------+-------------+-------------+
|    2 | 2015-01-02  |          25 |
|    4 | 2015-01-04  |          30 |
+------+-------------+-------------+

mysql> Create Table table_1qa2(
    -> id int,
    -> record_date date,
    -> temperature int
    -> );
Query OK, 0 rows affected (0.02 sec)

mysql> insert into table_1qa2 (id,record_date,temperature) values (1,'2015-01-01',10),(2,'2015-01-02',25),(3,'2015-01-03',20),(4,'2015-01-04',30);
Query OK, 4 rows affected (0.00 sec)

mysql> select t2.id,t2.record_date,t2.temperature from table_1qa2 t1, table_1qa2 t2
    ->     where t2.id = 1+t1.id and
    ->     t2.temperature > t1.temperature;
+------+-------------+-------------+
| id   | record_date | temperature |
+------+-------------+-------------+
|    2 | 2015-01-02  |          25 |
|    4 | 2015-01-04  |          30 |
+------+-------------+-------------+
</pre>